tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "k1low/tap"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Password generator
brew "pwgen"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Memory training application
cask "anki"
# Web browser focusing on privacy
cask "brave-browser"
# AI-powered translator
cask "deepl"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Free and open-source media player
cask "iina"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Music streaming service
cask "spotify"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Spark", id: 1176895641
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "robbowen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
